Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Methods
The AnalysisDesignParameter type exposes the following members.
Methods
Name | Description
Modify
 Modifies an analysis design parameter. The ID has to be set.
 (Overrides AnalysisDesignParameterBase.Modify().)
Select
 Selects an analysis design parameter.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisDesignParameter Class
Tekla.Structures.Analysis Namespace